app/controllers/products_controller.rb

INSERT INTO `products` (`age`, `country`, `created_at`, `name`, `updated_at`) VALUES (47, 'india', '2014-06-23 13:27:40', 'rizwan', '2014-06-23 13:27:40')
---
  def create
    @product = Product.new(params[:product])
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
UPDATE `products` SET `name` = 'kadiance12', `age` = 13, `country` = 'UK', `updated_at` = '2014-06-23 13:32:52' WHERE `products`.`id` = 6
---
  def update
    @product = Product.find(params[:id])
      if @product.update_attributes(params[:product])